jonathangray/openbsd-XF4/xc/programs/Xserver/hw/xfree86/input/ws/ms.man
.\"	$OpenBSD: ms.man,v 1.1 2005/02/16 20:04:16 matthieu Exp $
.\"
.\" Copyright (c) 2005 Matthieu Herrb
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.TH WS __drivermansuffix__ __vendorversion__
.SH NAME 
WS \- wscons pointer input driver for *BSD
.SH SYNOPSIS
.nf
.B "Section \*qInputDevice\*q"
.BI "    Identifier \*q" idevname \*q
.B  "    Driver \*qws\*q"
.BI "    Option \*qDevice\*q  \*q" depath \*q
\ \ ...
.B EndSection
.fi
.SH DESCRIPTION
.B ws 
in an XFree86/X.Org input driver for pointe devices (mouse,
touchscreen,...) drived by the wscons console driver on 
OpenBSD. 
.PP
Add more stuff here.
.SH "SEE ALSO"
Xorg(1), xorg.conf(__filemansuffix__)
