jonathangray/openbsd-XF4/xc-old/programs/Xserver/hw/xfree86/Xwrapper.man
.\" $OpenBSD: Xwrapper.man,v 1.3 2002/05/24 18:59:03 matthieu Exp $
.\"
.\" Copyright (c) 2002 Matthieu Herrb
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\"    - Redistributions of source code must retain the above copyright
.\"      notice, this list of conditions and the following disclaimer.
.\"    - Redistributions in binary form must reproduce the above
.\"      copyright notice, this list of conditions and the following
.\"      disclaimer in the documentation and/or other materials provided
.\"      with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.TH XFree86 1 "Version 3.3.6" "XFree86"
.SH NAME 
Xwrapper - setuid wrapper for XFreee86 3.3.6 servers
.SH SYNOPSIS
.B Xwrapper
[:displaynumber] [ option ] ...
.SH DESCRIPTION
Xwrapper is the setuid wrapper used by 
.B xinit(1)
to start the old X servers
(XF86_*) when not using xdm. 
This wrapper does a number of checks on the sanity of the arguments
before launching the real X server, as pointed to by the 
.B X 
symbolic link in /usr/X11R6/bin. 
.PP
In normal use
.B Xwrapper 
is not supposed to be called directly. 
.SH HISTORY
.B Xwrapper
appeared in 
.I XFree86 3.3.2
.br
It has been obsoleted by 
.I XFree86 4.0
and later. 
.br
.SH FILES
.nf
/usr/X11R6/bin/X
.fi
.SH "SEE ALSO"
X(1), Xserver(1), XFree86(1), XF86_SVGA(1), XF86_VGA16(1),
XF86_Mono(1), XF86_S3(1), XF86_8514(1), XF86_Mach8(1), XF86_Mach32(1),
XF86_P9000(1), XF86_AGX(1), XF86_W32(1), xinit(1), startx(1).
.SH AUTHORS
.PP
Refer to the
.I XFree86(1)
manual page.
