jonathangray/openbsd-XF4/xc-old/programs/Xserver/hw/xfree86/xf86config/xf86conf.man
.\" $XFree86: xc/programs/Xserver/hw/xfree86/xf86config/xf86conf.man,v 3.5.2.2 1999/08/02 08:38:25 hohndel Exp $
.TH xf86config 1 "Version 3.3.5" "XFree86"
.SH NAME
xf86config3 \- generate an XF86Config file for XFree86 3.3.x
.SH SYNOPSIS
.B xf86config3
.SH DESCRIPTION
\fIxf86config3\fP is an interactive program for generating an XF86Config file
for use with XFree86 3.3.x X servers.
.SH FILES
<xroot>/lib/X11/Cards            Video cards database
.SH "SEE ALSO"
XFree86(1), XF86Config-3(4/5), reconfig(1)
.SH AUTHOR
Harm Hanemaayer.
.\" $XConsortium: xf86conf.man /main/8 1996/12/09 17:38:03 kaleb $
